{"notes/inked/motivations.html":{"CompleteURL":"notes/inked/motivations.html","Date":1717718400,"Frontmatter":{"Title":"Motivations","Date":"2024-06-07","Draft":false,"JSFiles":null,"Type":"note","Description":"Tech has come far, and there are some parts which are spoilsports","PreviewImage":"","Tags":null,"TOC":false,"Authors":null,"Head":true},"Body":"\u003cp\u003eMy mother came up to me and asked about an app that virtually \u003cem\u003epins\u003c/em\u003e tasks to the Lock Screen of her phone. Well tons of them exist, but then the problem arises once again...the good old subscription plan.\u003c/p\u003e\n\u003cp\u003eI find the current state of apps pretty \u003cem\u003estinky\u003c/em\u003e. While there are so many available, I just can't find myself affording anything. Well it's understandable, we rely on S3 servers that in time are tremendously expensive and devs cant just live off of this. This led to the rise of the \u003cem\u003esubscription based models\u003c/em\u003e which is not really cheap. That aside, there are few apps, which provide the minimum functionality, that checks every box of requirements and yet has a monstrous price.\u003c/p\u003e\n","MarkdownBody":"My mother came up to me and asked about an app that virtually *pins* tasks to the Lock Screen of her phone. Well tons of them exist, but then the problem arises once again...the good old subscription ","LinkedNoteURLs":[],"LiveReload":false},"notes/inked/work.html":{"CompleteURL":"notes/inked/work.html","Date":1709942400,"Frontmatter":{"Title":"Quality of work","Date":"2024-03-09","Draft":false,"JSFiles":null,"Type":"note","Description":"A few thoughts off of my mind, my perspective on effort.","PreviewImage":"","Tags":null,"TOC":false,"Authors":null,"Head":true},"Body":"\u003cp\u003eA few thoughts off of my mind, my perspective on effort. It's something I'm a bit particular about. For me, there is a wall separating work achieved from hard work and work done for the sake of it. A wall that no one can pass through unless you change your approach or perspective of a situation.\u003c/p\u003e\n\u003cp\u003eI'm a person who is particular about my job. I tend to put myself down and set unrealistic expectations at times. Now people would say, I'm crazy for it. But, it's that mindset for me that makes me want to do more.\u003c/p\u003e\n\u003cp\u003eEvery second part of your effort on something counts, it makes a difference. For me, the end result must showcase that effort. You can't spend hours together working on something, only for the end result to be garbage. If it doesn't go in hand with the effort that pooled in.\u003c/p\u003e\n\u003cp\u003eBeing true to your work is one more thing that is very important. Set your margins high, as not everyone has the same perspective. Don't ever make assumptions about whether the other party is on the same wavelength as you are. Things break down real quick the moment that happens. You never expect it and then it hits you, had in the back. All that effort, gone down the drain, and now you're at square one.\u003c/p\u003e\n","MarkdownBody":"A few thoughts off of my mind, my perspective on effort. It's something I'm a bit particular about. For me, there is a wall separating work achieved from hard work and work done for the sake of it. A ","LinkedNoteURLs":[],"LiveReload":false}}